# 1. Banco de dado: Visão Geral

Sistemas para o gerenciamento e controle de informações e dados são comumente denominados na área de computação como banco de dados.

Existe uma grande variedade de modelos e linguagens para armazenar os dados e realizar esse gerenciamento destes.

Em relação aos modelos de banco de dados, isto é, a forma como os dados são organizados têm-se:

1. Modelo em Rede,
2. Modelo Hierárquico,
3. Modelo Relacional,
4. Orientado a objetos e
5. Objeto-Relacional.

Para realizar a organização, inclusão, modificação ou exclusão de valores de um dado banco de dados faz-se necessário o uso de um sistema de gerenciamento de banco de dados (SGBD). Ou seja, um conjunto de softwares que atuam no gerenciamento dos dados em acordo com algum modelo de banco de dados.

Além disso, é associada ao SGBD uma linguagem que possibilita a criação, atualização e consulta dos dados armazenados. Normalmente os comandos desta linguagem podem ser classificados em:

* Comandos para a **definição de dados**: CREATE, DROP e ALTER TABLE;
* Comandos para a **manipulação de dados**: UPDATE, SELECT, INSERT e DELETE;
* Comandos para o **controle de dados**: GRANT e REVOKE, em SQL.

Exemplos de SGBD são:

* mSQL
* MySQL
* SQL-Server
* TinySQL
* MongoDB
* PostgreSQL
* Oracle (banco de dados)
* CouchDB
* Firebird

Para efeito de aprendizagem será utilizada a linguagem **SQLITE 3** ao longo deste módulo.
SQLite é uma biblioteca em linguagem C que implementa um banco de dados SQL embutido.

É importante ressaltar que programas que usam a biblioteca SQLite podem ter acesso direto a um banco de dados SQL sem executar um processo SGBD separado.

Ou seja, a biblioteca SQLite lê e escreve diretamente no arquivo de banco de dados armazenado em algum dispositivo (no nosso caso nossa área no google drive), tornando o aprendizado mais simples e palpável.

O uso do SQLite é recomendado onde a simplicidade da administração, implementação e manutenção são mais importantes.

Exemplos de situações nas quais se recomenda o uso do SQLite são:

* Sites com menos de cem mil requisições por dia,
* Dispositivos e sistemas embarcados,
* Aplicações desktop,
* Ferramentas estatísticas e de análise,
* Aprendizado de banco de dados,
* Implementação de novas extensões de SQL.

O SQLite possui as seguintes características:

* É Software Livre/domínio público e multi-plataforma,
* É um mecanismo de armazenamento seguro com transações ACID,
* Não necessita de instalação, configuração ou administração,
* Implementa a maioria do SQL92 (padrão para banco de dados no modelo relacional),
* Permite guardar o banco de dados em um único arquivo,
* Suporta bases de dados abaixo de 2 terabytes,
* Não tem dependências externas.

# 2. Criando uma Tabela em um banco de dados

Um primeiro passo para se criar um banco de dados é armazenar um conjunto de informações seguindo a estrutura de uma tabela.

Por exemplo, suponha que deseja-se armazenar uma série de informações acerca de produtos em um estoque.

Uma forma simples de se armazenar as informações é agrupar os dados em uma tabela. Diz-se que a tabela armazena as informações associadas a uma entidade. Nesse exemplo, a tabela está associada a entidade **produtos**.

Cada linha dessa tabela será relacionado a um produto específico e é denominada de um **registro**. Cada coluna da tabela irá fornecer dados acerca de cada **registro**.

Para cada produto deseja-se armazenar três dados distintos quanto ao tipo do valor: **nome de um produto** (tipo **string**), **quantidade de produto** (tipo **int**), e **preço de uma unidade do produto** (tipo **float**).

Ao se criar uma tabela em um banco de dados os seguintes passos devem ser dados:

1. Criar uma conexão ao banco de dados associado a um arquivo com extensão **'.db'**;

2. A partir da variável que estabelece a conexão com o banco de dados é possível criar um objeto cursor que irá permitir a execução de comandos no **formato SQL**;

3. Para se criar uma tabela vazia, mas determinando-se quais serão suas colunas, pode-se empregar o comando **'create table'**. Além dele é interessante realizar uma verificação quanto a existência da tabela ou não no banco de dados com o comando **'if not exists'** seguido do nome da tabela que é **'store'** para realizar a ação. Por último, é necessário definir quais serão os tipos de variáveis a serem armazenados em cada coluna. Para o exemplo em questão: **TEXT**, **INTEGER** e **REAL**;

4. Após a execução de comando com o objeto cursor, o comando **'commit'** aplicado na variável que realiza o controle da conexão irá efetivar as alterações realizadas;

5. Por fim, é necessário sempre realizar a finalização da conexão com o banco de dados através do comando **'close'** aplicado no objeto de conexão com o banco de dados.

In [ ]:
import sqlite3

conn = sqlite3.connect("lite1.db")
cur  = conn.cursor()
cur.execute("CREATE TABLE IF NOT EXISTS store (item TEXT, quantity INTEGER, price REAL)")
conn.commit()
conn.close()

# 3. Visualizando o arquivo de banco de dados criado

Empregando o procedimento anteriormente descrito, foi criado um arquivo associado ao banco de dados em SQLITE3. Para verificar que esse arquivo está na sua área no Google drive é interessante realizar alguns comandos de sistema operacional:

1. **!pwd**, onde: ! significa que têm-se um comando para o sistema operacional, e pwd significa print work directory, ou seja, impressão do diretório de trabalho ou que atualmente está em uso.

2. **!ls**, onde: ls significa directory-listing, ou seja, listar os diretórios e pastas existentes.

In [ ]:
!pwd
!ls

/content
drive  lite1.db  sample_data

# 4. Inserindo dados na tabela

Para inserir dados em uma tabela é necessário enviar um comando SQL através do objeto cursor. Esse comando é o de inserção de um novo registro na tabela, isto é, **INSERT INTO**, seguido do nome da tabela (**store**) e do comando da inserção de valores (**VALUES**) contidos na seguinte tupla: **('Wine Glass', 8, 10.5)**.

Para efetivar a inserção de dados na tabela **store** é importante usar o comando **commit** (muitas vezes também fala-se em **'dar um commit'**) e fechar o arquivo do banco de dados.

In [ ]:
conn = sqlite3.connect("lite1.db")
cur  = conn.cursor()
cur.execute("INSERT INTO store VALUES ('Wine Glass',8,10.5)")
conn.commit()
conn.close()

# 5. Visualizando dados da tabela

Para exibir todos os registros contidos em uma tabela basta usar o comando para selecionar (**'SELECT'**) todas as colunas (**'*'**) da tabela com um dado nome (**store**). Depois é necessário armazenar os resultados obtidos em tuplas através do comando **fetchall** para o objeto cursor.

In [ ]:
conn = sqlite3.connect("lite1.db")
cur  = conn.cursor()
cur.execute("SELECT * FROM store")
rows=cur.fetchall()
conn.close()121
print(rows)

[('Wine Glass', 8, 10.5)]

# 6. Transformando dados de SQL para pandas

É possível tranformar os dados contidos em uma tabela do banco de dados para uma tabela de dados do **pandas**. Para tanto, usa-se o comando **read_sql_query** para transformar o resultado da seleção de todas as colunas de uma tabela (**SELECT * from store**) em um formato de tabela de dados (**DataFrame**).

In [ ]:
import pandas as pd

# Read sqlite query results into a pandas DataFrame
conn = sqlite3.connect("lite1.db")
df = pd.read_sql_query("SELECT * from store", conn)

conn.close()
df

         item  quantity  price
0  Wine Glass         8   10.5

# 7. Inserindo dados no dataframe

Após a criação de uma tabela de dados a partir de valores de uma tabela de um banco de dados, é possível acrescentar novos valores.

In [ ]:
products = ["Porto Wine", "Lemon Water", "Whisky", "NotMilk", "Sake", "Vodka"]
quantities = [3, 4, 7, 11, 5, 2]
prices = [40, 2, 60, 13, 15, 17]

cont = 0
for i,j,k in zip(products,quantities,prices):
  df.loc[cont] = [i, j, k]
  cont = cont+1

df

          item  quantity  price
0   Porto Wine         3   40.0
1  Lemon Water         4    2.0
2       Whisky         7   60.0
3      NotMilk        11   13.0
4         Sake         5   15.0
5        Vodka         2   17.0

# 8. Convertendo uma tabela de dados em uma tabela de um banco de dados

É possível converter os dados contidos em uma tabela de dados (**DataFrame**) em uma tabela de um banco de dados **SQLITE3**. Para tanto, basta utilizar o comando **to_sql** disponível para o tipo tabela de dados (**DataFrame**).

In [ ]:
conn = sqlite3.connect("lite1.db")
# Write the new DataFrame to a new SQLite table
df.to_sql("store", conn, index=False, if_exists="replace")
conn.close()

# Openning database to select all register from a table
# and view all values.
conn = sqlite3.connect("lite1.db")
cur  = conn.cursor()
cur.execute("SELECT * FROM store")
rows=cur.fetchall()
conn.close()
print(rows)

[('Porto Wine', 3, 40.0), ('Lemon Water', 4, 2.0), ('Whisky', 7, 60.0), ('NotMilk', 11, 13.0), ('Sake', 5, 15.0), ('Vodka', 2, 17.0)]

# 9. Mini-Projeto: Organizando as operações no banco de dados

Para facilitar a aplicação de certas operações como a adição, a visualização ou mesmo a eliminação de certos registros no banco de dados, pode-se organizar o código em termos de funções.

A seguir será mostrado como criar as seguintes funções nas tabelas de uma base de dados:

1. Criação de uma tabela e um banco de dados;
2. Inserção de um registro em uma tabela;
3. Visualização dos registros em uma tabela;
4. Transformação em uma tabela de dados;
5. Adição de valores através de uma tabela de dados;
6. Transformação de tabela de dados para tabela de banco de dados;
7. Eliminação de um registro;
8. Eliminação de todos os registros;
9. Eliminação da tabela de um banco de dados.

# 10. Mini-projeto: Criando um banco de dados e uma tabela

In [ ]:
import sqlite3

def create_table(dbname):
  conn = sqlite3.connect(dbname)
  cur  = conn.cursor()
  cur.execute("CREATE TABLE IF NOT EXISTS store (item TEXT, quantity INTEGER, price REAL)")
  conn.commit()
  conn.close()

# 11. Mini-projeto: Inserção e visualização de dados em uma tabela

In [ ]:
def insert(dbname,tabname,item, quantity, price):
  conn = sqlite3.connect(dbname)
  cur  = conn.cursor()
  #cur.execute("INSERT INTO store VALUES ('Wine Glass',8,10.5)")
  command = "INSERT INTO "+tabname+" VALUES (?,?,?)"
  cur.execute(command,(item,quantity,price))
  conn.commit()
  conn.close()

def view(dbname,tabname):
  conn = sqlite3.connect(dbname)
  cur  = conn.cursor()
  command = "SELECT * FROM "+tabname
  cur.execute(command)
  rows=cur.fetchall()
  conn.close()
  return rows

create_table("lite2.db")
insert("lite2.db","store",'Wine Glass', 10, 5)
print(view("lite2.db","store"))

[('Wine Glass', 10, 5.0)]

In [ ]:
!pwd
!ls

/content
drive  lite2.db  sample_data

# 12. Mini-projeto: Transformando a tabela do banco de dados em um **data frame**

In [ ]:
import pandas as pd

def tab2df(dbname,tabname):
  # Read sqlite query results into a pandas DataFrame
  conn = sqlite3.connect(dbname)
  command = "SELECT * from "+tabname
  df = pd.read_sql_query(command, conn)
  conn.close()
  return df

df1 = tab2df("lite2.db","store")
df1

         item  quantity  price
0  Wine Glass        10    5.0

# 13. Mini-projeto: Inserindo dados no **data frame**

In [ ]:
def addData(df1):
  products = ["Porto Wine", "Lemon Water", "Whisky", "NotMilk", "Sake", "Vodka"]
  quantities = [3, 4, 7, 11, 5, 2]
  prices = [40, 2, 60, 13, 15, 17]

  cont = 0
  for i,j,k in zip(products,quantities,prices):
    df1.loc[cont] = [i, j, k]
    cont = cont+1
  return df1

df1 = addData(df1)
df1

          item  quantity  price
0   Porto Wine         3   40.0
1  Lemon Water         4    2.0
2       Whisky         7   60.0
3      NotMilk        11   13.0
4         Sake         5   15.0
5        Vodka         2   17.0

# 14. Mini-projeto: Atualizando a tabela do banco de dados com os dados do **data frame**

In [ ]:
def df2db(dbname,tabname):
  conn = sqlite3.connect(dbname)
  # Write the new DataFrame to a new SQLite table
  df.to_sql(tabname, conn, index=False, if_exists="replace")
  conn.close()

print(view("lite2.db","store"))
df2db("lite2.db","store")
print(view("lite2.db","store"))

[('Wine Glass', 10, 5.0)]
[('Wine Glass', 10, 5.0)]

# 15. Mini-projeto: Eliminando um registro da tabela do banco de dados

In [ ]:
def deleteItem(dbname,tabname,item):
  conn = sqlite3.connect(dbname)
  cur  = conn.cursor()
  command = "DELETE FROM "+tabname+" WHERE item=?"
  cur.execute(command,(item,))
  conn.commit()
  conn.close()1

print(view("lite2.db","store"))
deleteItem("lite2.db","store","Porto Wine")
print(view("lite2.db","store"))

[('Wine Glass', 10, 5.0)]
[('Wine Glass', 10, 5.0)]

# 16. Mini-projeto: Eliminando todos os itens de uma tabela do banco de dados

In [ ]:
def deleteAllItems(dbname,tabname):
  conn = sqlite3.connect(dbname)
  cur  = conn.cursor()
  command = "DELETE FROM "+tabname+";"
  cur.execute(command,)
  conn.commit()
  conn.close()

print(view("lite2.db","store"))
deleteAllItems("lite2.db","store")
print(view("lite2.db","store"))

[('Wine Glass', 10, 5.0)]
[]

# 17. Mini-projeto: Eliminando uma tabela do banco de dados

In [ ]:
def deleteTable(dbname,tabname):
  conn = sqlite3.connect(dbname)
  cur  = conn.cursor()
  command = "DROP TABLE IF EXISTS "+tabname
  cur.execute(command)
  conn.commit()
  conn.close()


def showAll(dbname):
  conn = sqlite3.connect(dbname)
  cur  = conn.cursor()
  cur.execute('SELECT name from sqlite_master where type= "table"')
  print(cur.fetchall())

showAll("lite2.db")
deleteTable("lite2.db","store")
showAll("lite2.db")

[('store',)]
[]

https://www.sqlitetutorial.net/sqlite-python/create-tables/

https://colab.research.google.com/github/lucasmoratof/sql-projects/blob/master/Introduction_to_SQL_sub_queries.ipynb

https://www.w3schools.com/sql/sql_select.asp

https://docs.microsoft.com/pt-br/sql/t-sql/queries/select-examples-transact-sql?view=sql-server-ver15